const charging = 15.678;
const clock = 123.965;
const headphones = 90.2345;

/* Використовуючи вбудований об'єкт Math – виведіть максимальне число */
console.log("Максимальна ціна:", Math.max(charging, clock, headphones));

/* Використовуючи вбудований об'єкт Math – виведіть мінімальне число */
console.log("Мінімальна ціна:", Math.min(charging, clock, headphones));

/* Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму */
const allAmount = charging + clock + headphones;

console.log("Вартість всіх товарів:", allAmount);

/* Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНЬШУ сторону. */
const roundDown = Math.floor(charging) + Math.floor(clock) + Math.floor(headphones);

console.log("Вартість всіх товарів без копійок:", roundDown);

/* Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300) */
const roundUp = roundDown / 100;

console.log("Сума товарів округлену до сотень:", Math.round(roundUp) * 100);

/* Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом? */
if (allAmount % 2 === 0) {
    console.log((allAmount % 2 === 0).toString(), "- Парна");
} else {
    console.log((allAmount % 2 === 0).toString(), "- Непарна");
}

/* Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн. */
const pay = 500;
const check = pay - allAmount;

console.log("Сума решти, при оплаті всіх товарів:", check);

/* Виведіть середнє значення цін, округлене до другого знаку після коми */
const mean = +(allAmount / 3).toFixed(2);

console.log("Середнє значення цін:", mean);

/* (Більш складне) Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).
Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.
Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?
(Приклад: ціна була 260.66, знижка склала 10%, клієнт заплатив на 26 меньше, собівартість = 260 / 2 -> 130. Чистий прибуток = 130 - 26 -> 104) (Приклад 2: ціна була 100, знижка склала 90%, клієнт заплатив на 90 меньше, собівартість = 100 / 2 -> 50. Чистий прибуток = 50 - 90 -> -40) */
const randomPercent = Math.floor(Math.random() * 100);
const client = +(allAmount - (allAmount * randomPercent) / 100).toFixed(2);
const cost = +(allAmount / 2).toFixed(2);
const netProfit = +(client - cost).toFixed(2);

console.log("Випадкова знижка:", randomPercent);
console.log("Сума до оплати:", client);
console.log("Собівартість:", cost);
console.log("Чистий прибуток:", netProfit);